{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up", "Hello Zyo How are you", "How are you doing", "hai anyone here", "hi everyone", "what is happening", "what are you", "hello chatbot for explore indonesia", "nice to meet you", "glad to see you", "i need some help", "can you help me to explore indonesia", "what can you do", "is any bot here", "i want to talk with you", "can you help me right now"],
         "responses": ["Hello! I'm Zyo :)", "Good to see you again!", "Hi there, how can I help you?"],
         "context_set": ""
        },
        {"tag": "goodbye",
         "patterns": ["see ya", "See you later", "Goodbye", "I am Leaving","I am Leaving right now", "Have a Good day", "thats it, thankyou for helping me", "i will see you next time", "thank you so much for the information", "thats so helpful thankyou", "see you in another time", "see ya in another chance", "i will meet you again later", "hope to see you again", "that is enough for me", "i think its enough", "you are so helpful, thankyou so much", "you are the best chatbot thankyou", "i need to go right now goodbye my friend", "goodbye my best assistant", "bye friend, you are so helpful"],
         "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"],
         "context_set": ""
        },
        {"tag": "age",
         "patterns": ["how old are you", "how old is zyo", "what is your age", "how old are you", "what age are you?","can you tell me your age", "do you mind if i wanna know your age", "i want to know your age", "how many years old are you", "when is your birthday", "how young are you", "are you young", "are you old enough to guide me", "i hope i know your old", "can you tell me that you are older than me", "are you older than me", "are you younger than me", "we have the same old", "i am older than you", "i am younger than you", "you are 20 years old"],
         "responses": ["I am 20 years old!", "20 years young!"],
         "context_set": ""
        },
        {"tag": "name",
         "patterns": ["what is your name", "what should I call you", "whats your name?", "i want to know your name", "do you mind if you tell me your name", "i hope i know your name", "i just want to know what is your name", "is your name zyo", "what is your bot name", "your name i need to know who you are", "whats your  nickname", "what should i call your name", "i know your name is good", "please tell me your name first", "i need to remember your name", "i dont remember your name, can you tell me again", "i dont know who you are", "you can can tell me your name so we can talk", "is everyone know your name", "so your name is", "what if i dont know your name"],
         "responses": ["You can call me Zyo", "I'm Zyo!", "I'm Zyo! Your Virtual Tour Guide!"],
         "context_set": ""
        },
        {"tag": "weather_faq",
         "patterns": ["What's the weather like in Bali?", "How is the climate in Bali?", "How would you describe Bali's weather?", "How is the weather in Bali?", "How hot or cold is Bali?", "What season is Bali?", "I'm curious about the climate in Bali", "I'd like to know what the weather is like in Bali", "bali weather is the thing i dont know", "The thing I don't know about Bali is the weather", "I don't know anything about the weather in Bali", "I'm not familiar with Bali's weather", "I'm not sure about the weather in Bali", "is the weather rainy or winter or hot", "Is it hot, cold, or wet outside?", "is the weather comfortable there?", "Is the climate pleasant there?", "how to deal with the weather there", "how to handle the climate there", "I have to prepare for the weather there", "I need to get ready for the climate there"],
         "responses": ["Bali is generally hot, sunny and humid and typically the rainy season is between November - Feb/March. However rain usually pours heavily for a short duration in the afternoon or during the night, leaving the rest of the day warm and sunny (around 90 degrees) and cools off at night"],
         "context_set": ""
        },
        {"tag": "visa_faq",
         "patterns": ["Do I need a VISA to enter Bali?", "Is a VISA required to enter Bali?", "Is a VISA necessary to enter Bali?", "what if i dont have visa but i want to enter bali", "How would I get into Bali if I didn't have a visa?", "i want to know what kind of visa needed to go there", "i have to prepare visa to go to bali", "i dont have visa but i want to go there", "will i go to jail if i don't have a visa", "is visa the most important thing to go to Bali?", "i dont want to use my visa to go there", "do you mind to give me information about visa in bali", "i think i want to know about visa", "Would you mind providing me with information regarding Bali VISAs?", "you can educate me about Bali VISA requirements?", "If traveling to Bali, is a visa essential?", "Is obtaining a visa the most critical aspect of visiting Bali?", "i have a plan to make VISA, is it required?", "I want to apply for a VISA; is that necessary?", "Do I need to apply for a VISA if I have a plan to go?", "i dont have visa but i want to go there"],
         "responses": ["Indonesia has a free 30-Day visa-on-arrival system (tourist visa). If you would like to stay more than 30 days, then you will need to pay $35 at the airport when you arrive at the airport for the option to extend with an Indonesian agent for up to 60-days"],
         "context_set": ""
        },
        {"tag": "safe_faq",
         "patterns": ["Is Bali Safe?", "Is there much crime in Bali?", "Is Bali a secure destination?", "Is Bali a violent city?", "tell me about safety in bali", "Describe Bali's safety for me", "is bali secure?", "how about crime in bali?", "what is the crime rate in Bali?", "can i feel safe to live in bali", "what is level of crime in bali", "Is Bali a secure place to live?", "what if i meet violent crime", "how to be safe in bali", "what can i do if i see crime in bali", "i dont feel safe to travel to bali", "i want to know how often is crime in bali", "I'm curious how frequently crimes occur in Bali", "does crime often happen there", "what can i do to avoid crime", "i hope bali is a safe place to travel"],
         "responses": ["Bali has always been peaceful, As for safety in the streets, there is very little violent crime in Bali, especially in Ubud - just be cautious against pickpockets in the beach areas and with handbags on motorbikes late at night"],
         "context_set": ""
        },
        {"tag": "drinkwater_faq",
         "patterns": ["Can I drink the water?", "drinking Bali's water", "is water drinkable?", "drink water in Bali", "what id i drink water from bali", "please tell me about the water quality", "i want to drink the water", "how about the water quality", "i hope the water is good to drink", "what happen if i drink the water", "i want to feel the water", "i think the water quality is bad to drink", "bali's water quality is not for drink", "can i use the water to drink", "i feel bad to drink the water", "do you mind i you tell me about the water quality", "i just want to know how good is the water to drink", "every water in bali is good to drink", "water quality is not good to drink", "remind me to not drink the water", "i hope i find the good water to drink"],
         "responses": ["Always drink bottled or filtered water. 99% of restaurants in Bali use bottled water for all cooking purposes and it is advisable to drink and brush teeth with bottled water to avoid 'Bali Belly' - a mild dysentery which can occur but passes in a few days."],
         "context_set": ""
        },
        {"tag": "clothing_faq",
         "patterns": ["What clothing can I wear in Bali?", "what should i wear?", "clothes to wear in bali", "is wearing bikini allowed?", "i want to wear a baggy clothes", "i just want to know what clothes should i wear in bali", "please tell me about fashion rule", "what fashion that not allowed there", "what kind of fashion is not allowed in bali", "i hope i can wear bikini in bali", "what happen if i wear bikini in bali", "what if i wear a baggy clothes there", "can anybody wear anything there", "am i should wear sarong there", "what is the best clothes to traveling there", "what is the fashion i should afford to go there", "i think i need to prepare some clothes", "what clothes should i prepare to go there", "can you list all the clothes that i need to prepare for traveling there", "i hope the fashion culture not bad for me", "fashion is important to me what should i wear"],
         "responses": ["Where you will stay will 99% of the time be air conditioned or with a fan, but outside it is hot and humid. Flip flops or comfortable walking sandals are a must with light clothing like t-shirts and shorts to keep you cool are recommended and a light pullover in the evenings if you are riding a motorbike. When entering temples you must be respectful and have your shoulders covered and wear a sarong (for men and women)"],
         "context_set": ""
        },
        {"tag": "foodprice_faq",
         "patterns": ["What's the normal price for food in Bali?", "tell me food price in bali", "is the food cheap or expensive?", "can you tell me the price of the food?", "how about the food price there", "i want to know how is the food price", "i wanna know how expensive is the food there", "can you specify the food price there", "i hope the food is not expensive", "i hope i can afford the food", "what if i buy the food there", "how much money should i prepare to buy a food there", "is 200 enough to buy a food there", "the food is cheap there","i hope i can afford to buy a food there", "what happen if i wanna buy a food", "i hope you can tell me the food price list to me", "i want to buy the cheapest food", "i want to buy the most expensive food", "can you tell me how can i buy the cheapest food"],
         "responses": ["Local Indonesian food like nasi campur and nasi/mie goreng will cost you a lot less, around IDR 30,000 (USD $2.50), a meal at a mid range restaurant in will cost between IDR 100,000-250,000 ($12-20) and fine dining restaurants could cost anywhere between IDR 500,000 and 1,000,000+ ($40-$80)."],
         "context_set": ""
        },
        {"tag": "rentcar_faq",
         "patterns": ["Should I rent a car?", "what car i should rent?", "car rental available?", "i want to rent a car", "please help me to rent a car for traveling", "i hope i can rent a car there", "what i need to do to rent a car", "i think i need to rent a car for traveling there", "do you mind if you tell how can i rent a car", "i dont know how to rent a car", "is renting a car necessary", "is renting a car needed there", "what if i want to rent a car there", "i just want to know how to rent a car or motorcycle", "is rent vehicle important to do", "can you help me to rent a vehicle", "i dont have any vehicle, should i rent a car there", "am i need to have a vehicle to travel", "i dont have a car and want to rent one", "i think having a car is important to traveling there", "every traveler need to have a car"],
         "responses": ["It is not necessary, nor advisable to rent a car in Bali. Taxis will cost about $25 - $30 to take you from the Airport at Denpasar to Ubud (approximately 1.5-hour drive, depending on traffic). Most hotels offer a free shuttle or taxi service to take you to the town center in Ubud. You can also hire a private driver and car for $40 - $60 per day for day excursions."],
         "context_set": ""
        },
        {"tag": "buddhist_faq",
         "patterns": ["Is Bali a Buddhist country?", "what is most religion in bali", "Buddhist is majority religion there", "bali have a majority in islam?", "i want to know what religion is the most in bali", "what if i am not a buddisht", "is islam still majority in bali", "i dont know what religion that bali have", "i think bali is a buddisht majority","please tell me what the most religion in there", "i just want to know how massive is islam there", "i hope there is many moslem there", "is bali a moslem country", "am i need to be buddhist to go there", "i hope bali is moslem-friendly place", "is bali have a islamophobia", "i dont want to go to buddisht country", "i just want to go to moslem country", "i am a moslem, what happen if i go there", "i dont feel good to go to buddisht country", "i dont have religion, am i still can to go there"],
         "responses": ["Though Bali is a multi-religious island, most of the people on the island follow Balinese Hinduism which is a fusion of Indian and local Bali customs and culture. Muslim, Christianity, and Buddhism are a few other minority religions on the island."],
         "context_set": ""
        },
        {"tag": "language_faq",
         "patterns": ["What language do they speak in Bali?", "i need to know about bali language", "how they speak in bali", "is they speak in bahasa bali", "or do they speak in bahasa indonesia", "how language do balinese people speak", "can you tell me what language do they speak", "what happen if i dont know their language", "i need to learn indonesian language to go there", "i think the most difficulty that i have experienced is language", "i dont know anything about their language", "can you help me to learn indonesian language", "everything that i need to know is what language do they speak everyday", "i hope i can learn bali language easily", "i think peaople are speak indonesian or bali language", "do you ever speak indonesian", "i wanna know indonesian language to go there", "do balinese people can speak english", "balinese people are fluent in english", "what if i just can speak english", "what if i dont know any language but english"],
         "responses": ["Bahasa Bali and Bahasa Indonesian are the most prominent languages on the island. Most people in Balinese are bilingual and speak both these languages. A fewer people are fluent in the English language."],
         "context_set": ""
        },
        {"tag": "exchange_faq",
         "patterns": ["What is the exchange rate in Indonesia?", "how do i know the exchange rate there", "What is the current currency exchange rate in Indonesia?", "what is money they used", "how many dollar is rupiah", "i need to convert my money to what", "i dont know what money they usually used", "is dollar can used there", "i wonder if i use dollar in bali", "do i need to convert may money to rupiah or not", "what happen if i use dollar there", "i dont have any rupiah to go there", "i dont want to convert my money", "is any exchange rate that i shoul do there", "i just want to know what is rupiah", "do indonesia have currency", "what kind of currency that bali have", "i need to change my money to indonesia currency", "i dont know what currency that they used", "is any currency can be used there", "i hope i dont have to convert my money"],
         "responses": ["The most popular exchange rate in Indonesia is the USD to IDR rate. The national currency of Bali is the Indonesian Rupiah (Rp)."],
         "context_set": ""
        },
        {"tag": "whattoeat_faq",
         "patterns": ["What to eat in Bali?", "i want to eat delicious food in bali", "can you recommend me the best food in bali", "i dont know anything about bali food", "is any idea about delicious food in bali", "how is the recommended food there", "do you mind if you tell me the best food in bali", "i want you to recommend me the best food in bali", "i dont know what to eat, can you recommend me the recommended one", "i dont have any idea about the food that can satisfied my stomach", "i want to eat the best food that you have", "what happen if i dont anything about food in bali", "does bali have an authentic food", "i need to know every thing about recommended food, please suggest me", "i think the food is not good", "i really wanna know the bali food that have the best taste", "does food in bali taste delicious", "what kind of food i should try", "i wanto to try every food that bali have", "do you ever try any food in bali", "bali have a good taste in food"],
         "responses": ["When you are in Bali, you must try the authentic Balinese food as it is one of its kind and a lot of travelers visit Bali just to try the local delicacies. You must try dishes like Sate, Nasi Ayam, and Nasi Campur, Bebek and Ayam Betutu, Babi Guling and Traditional cakes and desserts."],
         "context_set": ""
        },
        {"tag": "bestressort_faq",
         "patterns": ["Which are the best beach resorts in Bali?","i want to know what is the best resort in bali", "i dont have any information about best resort in bali", "what happen if i wanna book a resorts", "do you have any recommendation resorts", "what resorts i should visit to have best experience", "i want to traveling for 5 days, what resorts should i stay", "i need to stay for couple days, please recommend me a resort", "what resorts should i stay for a couple days", "bali resort is amazing to stay", "i need to stay in resorts for a couple days", "how do you know about the resort", "please give me an idea to stay in resort", "best choice to stay in resort", "i hope every resort in bali is good to rest", "which resort that worth it to stay", "sometimes i need to holiday in resort", "best resort for staycation", "can i staycation in the resort, which resort is the best for that", "can you give me a suggestion about any resort to staycation", "what should i do to find a best resort"],
         "responses": ["If you are a beach lover and are planning to stay at a beach resort in Bali, then the best options for you are The Mulia, St.Regis Bali, The Royal Purnama and W Bali."],
         "context_set": ""
        },
        {"tag": "besthotel_faq",
         "patterns": ["Which are the best beach hotels in Bali?","i want to know what is the best hotel in bali", "i dont have any information about best hotel in bali", "what happen if i wanna book a hotels", "do you have any recommendation hotels", "what hotels i should visit to have best experience", "i want to traveling for 5 days, what hotels should i stay", "i need to stay for couple days, please recommend me a hotel", "what hotels should i stay for a couple days", "bali hotel is amazing to stay", "i need to stay in hotels for a couple days", "how do you know about the hotel", "please give me an idea to stay in hotel", "best choice to stay in hotel", "i hope every hotel in bali is good to rest", "which hotel that worth it to stay", "sometimes i need to holiday in hotel", "best hotel for staycation", "can i staycation in the hotel, which hotel is the best for that", "can you give me a suggestion about any hotel to staycation", "what should i do to find a best hotel"],
         "responses": ["The best hotels in Seminyak are Horison Seminyak, The Haven Bali Seminyak, Courtyard by Marriott Bali Seminyak Resort and Harris Hotel Seminyak."],
         "context_set": ""
        },
        {"tag": "timevisit_faq",
         "patterns": ["When is the best time to go?", "can you recommend me the best time to go there", "what time is the best to go vacation", "what the best time to come", "what year is the best to come to bali", "is october the best month to go to bali", "can you recomend me the month that the best month to go there", "i want to go on between august or september, is that the best time to go", "what happen if i go in january", "i just want to go in the best time to go there", "i hope i go in the best time for vacation", "i supposed to go in july", "i better go in february", "i hope go in any month is good", "any month is perfect to have a vacation there", "i prefer to go in july, is it a good time", "i dont want to go in august or november", "can anybody go there in any month", "i have a plan to visit bali in march, is that the best time to go", "can you choose me the time to visit, february or march is the best time", "is it better to come in end of the year"],
         "responses": ["Bali is a spectacular destination to visit all year round with stunning tropical scenery and endless opportunities for adventure. While temperatures tend to average 27 °C throughout the year, we recommend visiting between May to August for optimal tropical conditions without the holiday crowds."],
         "context_set": ""
        }
   ]
}